src/ExchangePlans/ОбменСУРМК/ОбменСУРМК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExchangePlan thisNode="40f23398-3d68-4834-98ce-1fde9c2f3fdb">
  <name>ОбменСУРМК</name>
  <attributes>
    <name>ВариантНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияФорматаОбмена</name>
    <comment>Версия формата обмена в формате ХХ.ХХ.ХХ.ХХ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>DefinedType.ВидЦенУРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОстаткиНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыгрузкиДокументов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОтборПоОрганизациям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрироватьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектУРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>УРМК</name>
    <type>
      <types>CatalogRef.УниверсальныеРабочиеМестаКассиров</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимВыгрузкиПриНеобходимости</name>
    <type>
      <types>EnumRef.РежимыВыгрузкиОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКонтрагентВозврата</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДоговор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКассаВозврата</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьКартыЛояльностиВРМК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.ОрганизацияУРМК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КассыККМ</name>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>DefinedType.КассаККМУРМК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьНастройкиВозвратаРасширенногоРежима</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>DefinedType.ОрганизацияУРМК</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КассаВозврата</name>
      <type>
        <types>CatalogRef.Кассы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExchangePlan>

src/Catalogs/УниверсальныеРабочиеМестаКассиров/УниверсальныеРабочиеМестаКассиров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УниверсальныеРабочиеМестаКассиров</name>
  <attributes>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектУРМК</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыКатегории</name>
    <comment>Настройка распределения продаж номенклатуры по группам, либо категориям</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КассыККМ</name>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>DefinedType.КассаККМУРМК</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РаспределениеНоменклатуры</name>
    <attributes>
      <name>ГруппаНоменклатуры</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияНоменклатуры</name>
      <type>
        <types>CatalogRef.КатегорииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СпециальныйНалоговыйРежим</name>
      <type>
        <types>EnumRef.СпециальныеНалоговыеРежимы</types>
      </type>
    </attributes>
    <attributes>
      <name>Патент</name>
      <type>
        <types>CatalogRef.Патенты</types>
      </type>
    </attributes>
    <attributes>
      <name>КассаККМ</name>
      <type>
        <types>CatalogRef.КассыККМ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ExchangePlans/ОбменСУРМК/Forms/ФормаУзла/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьРасширенныйРежимНастройкиУРМК = ИнтеграцияУРМКСлужебный.ИспользоватьРасширенныйРежимНастройкиУРМК();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Оповестить("Запись_УзелПланаОбмена");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ОбменДаннымиСервер.ФормаУзлаПриЗаписиНаСервере(ТекущийОбъект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ОбменДаннымиКлиент.ФормаНастройкиПередЗакрытием(Отказ, ЭтотОбъект, ЗавершениеРаботы);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПустаяСсылкаКассаККМ = Метаданные.ОпределяемыеТипы.КассаККМУРМК.Тип.ПривестиЗначение();
	ПустаяСсылкаОрганизация = Метаданные.ОпределяемыеТипы.ОрганизацияУРМК.Тип.ПривестиЗначение();
	
	ОрганизацияТипРеквизитаСтрокой = ОбщегоНазначения.СтроковоеПредставлениеТипа(ТипЗнч(ПустаяСсылкаОрганизация));
	ИмяРеквизитаОрганизация = ИнтеграцияУРМКСлужебный.ИменаРеквизитовПоТипу(ПустаяСсылкаКассаККМ, Тип(ОрганизацияТипРеквизитаСтрокой));
	
	Если ИмяРеквизитаОрганизация = "" Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаДанных Из Объект.КассыККМ Цикл
		Если Объект.Организации.Количество() > 0 Тогда
			СтрокаДанных.Организация = СтрокаДанных.КассаККМ[ИмяРеквизитаОрганизация];
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ОбновлениеОтборовНаУзле" Тогда
		ЭтотОбъект.Прочитать();
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ИзменитьСоставКассККМ(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Объект.УРМК);
	
	ОткрытьФорму("Справочник.УниверсальныеРабочиеМестаКассиров.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастроитьФорму()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ГруппаЭлементыРасширенногоРежима",
		"Видимость",
		ИспользоватьРасширенныйРежимНастройкиУРМК);

КонецПроцедуры

#КонецОбласти
